cfg/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Documents/УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидыЦенПриАктивизацииСтроки(Элемент)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
		Элементы.Номенклатура.ОтборСтрок = Отбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		СтрокаТЧ.КлючСвязи = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	Элементы.Номенклатура.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	СтрокаТЧНом = Элементы.Номенклатура.ТекущиеДанные;
	Если НоваяСтрока Тогда
		СтрокаТЧНом.КлючСвязи = СтрокаТЧ.КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПередУдалением(Элемент, Отказ)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	
	Отбор = Новый Структура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	МассивСтрок = Объект.Номенклатура.НайтиСтроки(Отбор);
	
	Для Каждого Элемент Из МассивСтрок Цикл
		Объект.Номенклатура.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	А = 1;
КонецПроцедуры
